app/controllers/entries_controller.rb

  def index
    @entries = Entry.order(created_at: :desc).limit(10)
    @entries.each do |entry|
---
SELECT  "entries".* FROM "entries" ORDER BY "entries"."created_at" DESC LIMIT $1  [["LIMIT", 10]]
SELECT "entries".* FROM "entries"

  def create
    @entry = Entry.new(entry_params)
    @entry.save
---
INSERT INTO "entries" ("title", "subhead", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Noticia 2"], ["subhead", "Bajada de Noticia 2"], ["body", "Cuerpo de Noticia 2"], ["created_at", "2018-03-19 06:46:42.632457"], ["updated_at", "2018-03-19 06:46:42.632457"]]

  def update
    @entry = Entry.find(params[:id])
---
SELECT  "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]